app/controllers/properties_controller.rb

INSERT INTO "properties" ("title", "description", "price", "image", "city", "zip_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @property = Property.new(property_params)

    if @property.save